 #+STARTUP: overview


** TODO skonfigurowac emacsa z testami, gdb, gud, ddd, CMock Cunit
   :LOGBOOK:
   CLOCK: [2017-03-15 Wed 14:47]--[2017-03-15 Wed 22:09] =>  7:22
   :END:

**** start on current item C-c C-x C-i, potem C-o
     :LOGBOOK:
     CLOCK: [2017-03-08 Wed 23:38]--[2017-03-08 Wed 23:43] =>  0:05
     CLOCK: [2017-03-08 Wed 23:21]--[2017-03-08 Wed 23:38] =>  0:17
     :END:
     C-c C-x C-x - Org-clock-in-last lub dowolne z C-u -multitasking wybor zadan
*** capture zlapac zapisac `C-c c     (`org-capture')'
     :LOGBOOK:
     CLOCK: [2017-03-08 Wed 23:43]--[2017-03-09 Thu 00:49] =>  1:06
     :END:
     Call the command `org-capture'.  Note that this key binding is
     global and not active by default: you need to install it.  If you
     have templates defined *note Capture templates::, it will offer
     these templates for selection or use a new Org outline node as the
     default template.  It will insert the template into the target
     file and switch to an indirect buffer narrowed to this new node.
     You may then insert the information you want.

`C-c C-c     (`org-capture-finalize')'
     Once you have finished entering information into the capture
     buffer, `C-c C-c' will return you to the window configuration
     before the capture process, so that you can resume your work
     without further distraction.  When called with a prefix arg,
     finalize and then jump to the captured item.

`C-c C-w     (`org-capture-refile')'
     Finalize the capture process by refiling (*note Refile and copy::)
     the note to a different place.  Please realize that this is a
     normal refiling command that will be executed--so the cursor
     position at the moment you run this command is important.  If you
     have inserted a tree with a parent and children, first move the
     cursor back to the parent.  Any prefix argument given to this
     command will be passed on to the `org-refile' command.

`C-c C-k     (`org-capture-kill')'
     Abort the capture process and return to the previous state.

   You can also call `org-capture' in a special way from the agenda,
using the `k c' key combination.

*** latex
    :LOGBOOK:
    CLOCK: [2017-03-09 Thu 00:49]--[2017-03-09 Thu 01:15] =>  0:26
    :END:
For example:

     \begin{equation}
     x=\sqrt{b}
     \end{equation}

     If $a^2=b$ and \( b=2 \), then the solution must be
     either $$ a=+\sqrt{2} $$ or \[ a=-\sqrt{2} \].


`C-c C-x C-l'
     Produce a preview image of the LaTeX fragment at point and overlay
     it over the source code.  If there is no fragment at point,
     process all fragments in the current entry (between two
     headlines).  When called with a prefix argument, process the
     entire subtree.  When called with two prefix arguments, or when
     the cursor is before the first headline, process the entire buffer.  

`C-c C-c'
     Remove the overlay preview images.

   You can turn on the previewing of all LaTeX fragments in a file with

     #+STARTUP: latexpreview
***** TODO Elisp
      :LOGBOOK:
      CLOCK: [2017-03-09 Thu 15:34]--[2017-03-12 Sun 15:38] => 72:04
      :END:


#+BEGIN_SRC emacs-lisp
     (defun append-to-buffer (buffer start end)
       "Append to specified buffer the text of the region.
     It is inserted into that buffer before its point.

     When calling from a program, give three arguments:
     BUFFER (or buffer name), START and END.
     START and END specify the portion of the current buffer to be copied."
       (interactive
        (list (read-buffer "Append to buffer: " (other-buffer
                                                 (current-buffer) t))
              (region-beginning) (region-end)))
       (let ((oldbuf (current-buffer)))
         (save-excursion
           (let* ((append-to (get-buffer-create buffer))
                  (windows (get-buffer-window-list append-to t t))
                  point)
             (set-buffer append-to)
             (setq point (point))
             (barf-if-buffer-read-only)
             (insert-buffer-substring oldbuf start end)
             (dolist (window windows)
               (when (= (window-point window) point)
                 (set-window-point window (point))))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun eob ()
    (interactive)
  (push-mark)
  (goto-char (point-min)))

(defun czy (nazwa)
   (interactive "B")
       (if (get-buffer nazwa) "yes" "no"))
#+END_SRC

-- User Option: edebug-save-displayed-buffer-points
     If this is non-‘nil’, Edebug saves and restores point in all
     displayed buffers.

     Saving and restoring point in other buffers is necessary if you are
     debugging code that changes the point of a buffer that is displayed
     in a non-selected window.  If Edebug or the user then selects the
     window, point in that buffer will move to the window’s value of
     point.

     Saving and restoring point in all buffers is expensive, since it
     requires selecting each window twice, so enable this only if you
     need it.  *Note Edebug Display Update::.


**** CAPTURE
     :LOGBOOK:
     CLOCK: [2017-03-09 Thu 01:15]--[2017-03-09 Thu 12:29] => 11:14
     :END:
**** DONE flymake
     :LOGBOOK:
     CLOCK: [2017-03-09 Thu 13:03]--[2017-03-09 Thu 15:34] =>  2:31
     :END:
   Logging output is controlled by the ‘flymake-log-level’ variable.
‘3’ is the most verbose level
F3
F4
**** SREncode
     :LOGBOOK:
     CLOCK: [2017-03-09 Thu 12:29]--[2017-03-09 Thu 13:03] =>  0:34
     :END:
